# cx_Oracle 모듈
- 파이썬에서 오라클 DBMS와 연동는 다양한 함수를 제공하는 모듈
- Python DB API 2.0 표준을 따른다. 

## 참고
- [cx_Oracle 모듈 홈페이지](https://oracle.github.io/python-cx_Oracle/)
- [Python DB API](https://docs.python.org/ko/3/library/sqlite3.html)

## cx_Oracle 모듈 설치
- [설치 튜토리얼](https://cx-oracle.readthedocs.io/en/latest/user_guide/installation.html)
- 패키지 설치
```
conda install cx_oracle
pip install cx_Oracle --upgrade
```

In [ ]:
pip install cx-Oracle

## 코딩 절차
1. cx_Oracle 모듈 import

2. cx_Oracle모듈의 connect() 함수를 이용해 디비연결

3. Connection 객체의 cursor() 메소드를 이용해 Cursor객체 조회.
    - Cursor객체: sql문을 전송하고 select결과 조회 기능을 제공하는 객체

4. Cursor 의 execute() 메소드를 이용해 SQL문 전송

5. SELECT 의 경우 결과 조회.
    - 조회결과 한행씩 반환받아 사용
    - 조회결과 한번에 반환받아 사용

6. INSERT/DELETE/UPDATE의 경우  SQL 문 실행 후 Connection의 commit() 메소드를 이용해 Transaction 처리

7. Cursor, Connection 연결 닫기

### DB 연결
- connect() 함수를 이용하며 연결 후 Connection 객체를 받는다.
- 연결시 필요한 값
    - **host**
    - **port번호**
    - **SID(DB이름)**
    - **user name**
    - **password**

### Connection 주요 메소드
- commit(): 커밋
- rollback(): 롤백
- close(): 연결 닫기

In [11]:
import cx_Oracle
username = 'c##scott_join'
password = 'tiger'
url = 'localhost:1521/XE'  # host:port/sid
conn = cx_Oracle.connect(username, password, url) #연결시도.
print(type(conn))
conn.close()

<class 'cx_Oracle.Connection'>

In [12]:
conn2 = cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE")
print(type(conn2))
conn2.close()

<class 'cx_Oracle.Connection'>

#### DSN (Data Source Name) 을 이용한 연결
- DSN: DBMS를 연결하기 위한 정보를 모아 놓은 것. (서로 다른 DBMS의 연결정보를 통일하기 위해서 방식)
- makedsn(host, port번호, SID) 함수 이용해 생성한다.

In [13]:
username = 'c##scott_join'
password = 'tiger'
host = 'localhost'
port = 1521
sid = 'XE'
dsn = cx_Oracle.makedsn(host, port, sid)
print(dsn)
conn3 = cx_Oracle.connect(username, password, dsn)
print(type(conn3))
conn3.close()

(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521))(CONNECT_DATA=(SID=XE)))
<class 'cx_Oracle.Connection'>

In [15]:
# with block을 빠져나오면 자동으로 close() 처리
with cx_Oracle.connect(username, password, dsn) as conn4:
    # db관련작업 conn4.xxxxx()
    pass

## Cursor 객체
- SQL문을 전송하고 select결과를 조회하는 메소드들을 제공한다.
- Connection객체의 cursor() 메소드로 받아온다.

### Cursor의 주요 메소드
#### SQL 실행 메소드
- execute(sql) : 하나의 sql 문 실행. 
- executemany(sql): insert, update, delete 배치 처리
    - insert, update, delete는 다 처리후 conn.commit()으로 커밋 처리해야한다.

#### select 결과 조회 메소드
- execute()로 실행한 SQL이 select인 경우 다음 메소드로 조회한다.
- fetchall()  : 조회된 모든 행을 한번에 가져올 때 사용한다. 결과를 tuple들을 묶은 리스트로 반환
- fetchone()  : 호출시 마다 한행씩 반환한다. PK로 조회한 경우 많이 사용한다.
- fetchmany(n): n행만큼 조회한다. n기본값-100. 특정개수반큼 반복문을 이용해 가져올때 사용.

In [1]:
import cx_Oracle
from pprint import pprint # 자료구조를 보기좋게 출력해주는 print함수.

In [25]:
# sql문: 문자열로 작성. 대소문자 구분안한다. (sql의 keyword들은 보통 대문자, 컬럼명/테이블명은 소문자)
# ';' 은 뒤에 붙이지 않는다.
select_sql = "SELECT emp_id, emp_name, job_id FROM emp"
insert_sql = "INSERT INTO emp VALUES (1503, 'HONG', 'FI_ACCOUNT','101', to_date('2021/02/15','yyyy/mm/dd'), 30000, 0.2,100)"
conn = None # Connection을 대입할 변수
cursor = None # Cursor 객체를 대입할 변수

try:
    #1. 연결
    conn = cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE")
    print("연결완료")
    #2. Cursor생성
    cursor = conn.cursor()

    #3. sql 실행
    #cursor.execute(insert_sql)
    cursor.execute(select_sql)
    
    #4. select 결과 조회
    result = cursor.fetchall() # 조회결과를 한번에 반환. 한행-tuple, 리스트로 tuple들을 묶어서 반환.
    print(type(result), type(result[0]))
    print(len(result))
    pprint(result)
    
    #5.insert/update/delete를 실행한 경우 commit처리
    conn.commit()
    
except Exception as e:
    print(e)

finally:
    #6. 연결닫기 cursor/connection
    if cursor != None:
        cursor.close()
    if conn != None:
        conn.close()

연결완료
<class 'list'> <class 'tuple'>
114
[(1502, 'HONG', 'FI_ACCOUNT'),
 (1503, 'HONG', 'FI_ACCOUNT'),
 (2001, '이순신', 'FI_ACCOUNT'),
 (100, 'Steven', 'AD_PRES'),
 (101, 'Neena', 'AD_VP'),
 (102, 'Lex', 'AD_VP'),
 (103, 'Alexander', 'IT_PROG'),
 (104, 'Bruce', 'IT_PROG'),
 (105, 'David', 'IT_PROG'),
 (106, 'Valli', 'IT_PROG'),
 (107, 'Diana', 'IT_PROG'),
 (108, 'Nancy', 'FI_MGR'),
 (109, 'Daniel', 'FI_ACCOUNT'),
 (110, 'John', 'FI_ACCOUNT'),
 (111, 'Ismael', 'FI_ACCOUNT'),
 (112, 'Jose Manuel', 'FI_ACCOUNT'),
 (113, 'Luis', 'FI_ACCOUNT'),
 (114, 'Den', 'PU_MAN'),
 (115, 'Alexander', 'PU_MAN'),
 (116, 'Shelli', 'PU_CLERK'),
 (117, 'Sigal', 'PU_CLERK'),
 (118, 'Guy', 'PU_CLERK'),
 (119, 'Karen', 'PU_CLERK'),
 (120, 'Matthew', 'ST_MAN'),
 (121, 'Adam', 'ST_MAN'),
 (122, 'Payam', 'ST_MAN'),
 (123, 'Shanta', 'ST_MAN'),
 (124, 'Kevin', 'ST_MAN'),
 (125, 'Julia', 'ST_CLERK'),
 (126, 'Irene', 'ST_CLERK'),
 (127, 'James', 'ST_CLERK'),
 (128, 'Steven', 'ST_CLERK'),
 (129, 'Laura', 'ST_CLERK'),
 (130, 'Mozhe', None),
 (131, 'James', None),
 (132, 'TJ', 'ST_CLERK'),
 (133, 'Jason', 'ST_CLERK'),
 (134, 'Michael', 'ST_CLERK'),
 (135, 'Ki', 'ST_CLERK'),
 (136, 'Hazel', 'ST_CLERK'),
 (137, 'Renske', 'ST_CLERK'),
 (138, 'Stephen', 'ST_CLERK'),
 (139, 'John', 'ST_CLERK'),
 (140, 'Joshua', None),
 (141, 'Trenna', 'ST_CLERK'),
 (142, 'Curtis', 'ST_CLERK'),
 (143, 'Randall', 'ST_CLERK'),
 (144, 'Peter', 'ST_CLERK'),
 (145, 'John', 'SA_MAN'),
 (146, 'Karen', 'SA_MAN'),
 (147, 'Alberto', 'SA_MAN'),
 (148, 'Gerald', 'SA_MAN'),
 (149, 'Eleni', 'SA_MAN'),
 (150, 'Peter', 'SA_REP'),
 (151, 'David', 'SA_REP'),
 (152, 'Peter', 'SA_REP'),
 (153, 'Christopher', 'SA_REP'),
 (154, 'Nanette', 'SA_REP'),
 (155, 'Oliver', 'SA_REP'),
 (156, 'Janette', 'SA_REP'),
 (157, 'Patrick', 'SA_REP'),
 (158, 'Allan', 'SA_REP'),
 (159, 'Lindsey', 'SA_REP'),
 (160, 'Louise', 'SA_REP'),
 (161, 'Sarath', 'SA_REP'),
 (162, 'Clara', 'SA_REP'),
 (163, 'Danielle', 'SA_REP'),
 (164, 'Mattea', 'SA_REP'),
 (165, 'David', 'SA_REP'),
 (166, 'Sundar', 'SA_REP'),
 (167, 'Amit', 'SA_REP'),
 (168, 'Lisa', 'SA_REP'),
 (169, 'Harrison', 'SA_REP'),
 (170, 'Tayler', 'SA_REP'),
 (171, 'William', 'SA_REP'),
 (172, 'Elizabeth', 'SA_REP'),
 (173, 'Sundita', 'SA_REP'),
 (174, 'Ellen', 'SA_REP'),
 (175, 'Alyssa', 'SA_REP'),
 (176, 'Jonathon', 'SA_REP'),
 (177, 'Jack', 'SA_REP'),
 (178, 'Kimberely', 'SA_REP'),
 (179, 'Charles', 'SA_REP'),
 (180, 'Winston', 'SH_CLERK'),
 (181, 'Jean', 'SH_CLERK'),
 (182, 'Martha', 'SH_CLERK'),
 (183, 'Girard', 'SH_CLERK'),
 (184, 'Nandita', 'SH_CLERK'),
 (185, 'Alexis', 'SH_CLERK'),
 (186, 'Julia', 'SH_CLERK'),
 (187, 'Anthony', None),
 (188, 'Kelly', 'SH_CLERK'),
 (189, 'Jennifer', 'SH_CLERK'),
 (190, 'Timothy', None),
 (191, 'Randall', None),
 (192, 'Sarah', 'SH_CLERK'),
 (193, 'Britney', 'SH_CLERK'),
 (194, 'Samuel', 'SH_CLERK'),
 (195, 'Vance', 'SH_CLERK'),
 (196, 'Alana', 'SH_CLERK'),
 (197, 'Kevin', 'SH_CLERK'),
 (198, 'Donald', 'SH_CLERK'),
 (199, 'Douglas', 'SH_CLERK'),
 (200, 'Jennifer', 'AD_ASST'),
 (201, 'Michael', 'MK_MAN'),
 (202, 'Pat', 'MK_REP'),
 (203, 'Susan', 'HR_REP'),
 (204, 'Hermann', 'PR_REP'),
 (205, 'Shelley', 'AC_MGR'),
 (206, 'William', 'AC_ACCOUNT'),
 (1200, '강길동', 'FI_ACCOUNT'),
 (1500, 'HONG', 'FI_ACCOUNT'),
 (1501, 'HONG', 'FI_ACCOUNT'),
 (2000, '이순신', 'FI_ACCOUNT')]

## placeholder(자리표시자)를 이용해 sql 실행
- SQL에 값이 들어갈 자리에 값을 대신할 문자 **`:순번` 또는 `:이름`** 를 넣고 SQL 실행시 값을 전달
> placehold 는 DBMS마다 다르다. 
- execute(SQL, placeholder에 들어갈 값)
    - 딕셔너리: placeholder의 이름-값 형식
    - 리스트나 튜플: placeholder 순서

In [16]:
import cx_Oracle
from pprint import pprint

In [24]:
select_sql = "SELECT * FROM emp WHERE salary BETWEEN :1 AND :2"
insert_sql = "INSERT INTO emp VALUES(:id, :name, :job_id, :mgr_id, to_date(:hire_date,'yyyymmdd'),:salary, :comm_pct, :dept_id)"

conn = None
cursor = None
try:
    conn = cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE")
    cursor = conn.cursor()
    # sql 문 실행
    # varchar2/char/nvarchar/nchar - str
    # number(정수/실수) - int/double
    # date : datetime
    # null - None

    param_dict = {
        'id':2001,
        'name':'이순신',
        'job_id': 'FI_ACCOUNT',
        'mgr_id': 101,
        'hire_date':'20210213',
        'salary': 18888,
        'comm_pct': None,
        'dept_id':110
    }
    
    cursor.execute(insert_sql, param_dict)

    cursor.execute(select_sql, [15000,20000])
    result1 = cursor.fetchall()
    print("15000 ~ 20000 사이 salary 조회")
    pprint(result1)

    cursor.execute(select_sql, [2000,3000])
    result2 = cursor.fetchall()
    print("2000 ~ 3000 사이 salary 조회")
    pprint(result2)
    
    conn.commit()
except Exception as e:
    print(e)
finally:
    if cursor:
        cursor.close()
    if conn:
        conn.close()

15000 ~ 20000 사이 salary 조회
[(2001,
  '이순신',
  'FI_ACCOUNT',
  101,
  datetime.datetime(2021, 2, 13, 0, 0),
  18888.0,
  None,
  110),
 (101,
  'Neena',
  'AD_VP',
  100,
  datetime.datetime(2005, 9, 21, 0, 0),
  17000.0,
  None,
  90),
 (102,
  'Lex',
  'AD_VP',
  100,
  datetime.datetime(2001, 1, 13, 0, 0),
  17000.0,
  None,
  90),
 (2000,
  '이순신',
  'FI_ACCOUNT',
  101,
  datetime.datetime(2021, 2, 13, 0, 0),
  19990.0,
  None,
  110)]
2000 ~ 3000 사이 salary 조회
[(116,
  'Shelli',
  'PU_CLERK',
  114,
  datetime.datetime(2005, 12, 24, 0, 0),
  2900.0,
  None,
  30),
 (117,
  'Sigal',
  'PU_CLERK',
  114,
  datetime.datetime(2005, 7, 24, 0, 0),
  2800.0,
  None,
  30),
 (118,
  'Guy',
  'PU_CLERK',
  114,
  datetime.datetime(2006, 11, 15, 0, 0),
  2600.0,
  None,
  30),
 (119,
  'Karen',
  'PU_CLERK',
  114,
  datetime.datetime(2007, 8, 10, 0, 0),
  2500.0,
  None,
  30),
 (126,
  'Irene',
  'ST_CLERK',
  120,
  datetime.datetime(2006, 9, 28, 0, 0),
  2700.0,
  None,
  50),
 (127,
  'James',
  'ST_CLERK',
  120,
  datetime.datetime(2007, 1, 14, 0, 0),
  2400.0,
  None,
  50),
 (128,
  'Steven',
  'ST_CLERK',
  120,
  datetime.datetime(2008, 3, 8, 0, 0),
  2200.0,
  None,
  50),
 (130,
  'Mozhe',
  None,
  121,
  datetime.datetime(2005, 7, 16, 0, 0),
  2800.0,
  None,
  50),
 (131,
  'James',
  None,
  121,
  datetime.datetime(2005, 2, 16, 0, 0),
  2500.0,
  None,
  50),
 (132,
  'TJ',
  'ST_CLERK',
  121,
  datetime.datetime(2007, 4, 10, 0, 0),
  2100.0,
  None,
  50),
 (134,
  'Michael',
  'ST_CLERK',
  122,
  datetime.datetime(2006, 8, 26, 0, 0),
  2900.0,
  None,
  50),
 (135,
  'Ki',
  'ST_CLERK',
  122,
  datetime.datetime(2007, 12, 12, 0, 0),
  2400.0,
  None,
  50),
 (136,
  'Hazel',
  'ST_CLERK',
  122,
  datetime.datetime(2008, 2, 6, 0, 0),
  2200.0,
  None,
  50),
 (139,
  'John',
  'ST_CLERK',
  123,
  datetime.datetime(2008, 2, 6, 0, 0),
  2700.0,
  None,
  50),
 (140,
  'Joshua',
  None,
  123,
  datetime.datetime(2008, 2, 6, 0, 0),
  2500.0,
  None,
  50),
 (143,
  'Randall',
  'ST_CLERK',
  124,
  datetime.datetime(2006, 3, 15, 0, 0),
  2600.0,
  None,
  50),
 (144,
  'Peter',
  'ST_CLERK',
  124,
  datetime.datetime(2006, 7, 9, 0, 0),
  2500.0,
  None,
  50),
 (182,
  'Martha',
  'SH_CLERK',
  120,
  datetime.datetime(2007, 6, 21, 0, 0),
  2500.0,
  None,
  50),
 (183,
  'Girard',
  'SH_CLERK',
  120,
  datetime.datetime(2008, 2, 3, 0, 0),
  2800.0,
  None,
  None),
 (187,
  'Anthony',
  None,
  121,
  datetime.datetime(2007, 2, 7, 0, 0),
  3000.0,
  None,
  50),
 (190,
  'Timothy',
  None,
  122,
  datetime.datetime(2006, 7, 11, 0, 0),
  2900.0,
  None,
  50),
 (191,
  'Randall',
  None,
  122,
  datetime.datetime(2007, 6, 21, 0, 0),
  2500.0,
  None,
  50),
 (195,
  'Vance',
  'SH_CLERK',
  123,
  datetime.datetime(2007, 6, 21, 0, 0),
  2800.0,
  None,
  50),
 (197,
  'Kevin',
  'SH_CLERK',
  124,
  datetime.datetime(2006, 5, 23, 0, 0),
  3000.0,
  None,
  50),
 (198,
  'Donald',
  'SH_CLERK',
  124,
  datetime.datetime(2007, 6, 21, 0, 0),
  2600.0,
  None,
  50),
 (199,
  'Douglas',
  'SH_CLERK',
  124,
  datetime.datetime(2007, 6, 21, 0, 0),
  2600.0,
  None,
  50)]

## SELECT  결과 조회

### fetchone()
- 조회결과 한행씩 반환한다.
- PK로 조회시 사용한다.

### fetchall()
- 조회한 전체 결과셋을 반환한다.
- 한 row를 Tuple로 묶고 그 Tuple들을 List로 묶어서 반환한다.

### fetchmany(n)
- n 행씩 조회할 때 사용
- n 기본값 100

In [26]:
import cx_Oracle

def select_emp_by_id(emp_id):
    sql = "SELECT * FROM emp WHERE emp_id = :1"
    # conn, cursor = None, None

    with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
        with conn.cursor() as cursor:
            # sql 실행
            cursor.execute(sql, [emp_id])
            result = cursor.fetchone()  # 1행만 조회. 조회결과가 없으면 None을 반환
            return result

In [27]:
r = select_emp_by_id(100)
print(r,"id:", r[0],'이름:', r[1])

(100, 'Steven', 'AD_PRES', 100, datetime.datetime(2003, 6, 17, 0, 0), 27000.0, 0.2, 90) id: 100 이름: Steven

In [28]:
r= select_emp_by_id(3000)
if r:
    print(r)
else:
    print("조회결과가 없습니다.", r)

조회결과가 없습니다. None

In [32]:
sql = "SELECT * FROM emp order by emp_id"
with cx_Oracle.connect('c##scott_join/tiger@localhost:1521/XE') as conn2:
    with conn2.cursor() as cursor2:
        cursor2.execute(sql)
        #result1 = cursor2.fetchall()
        result1 = cursor2.fetchmany(10)  # default 값은 100개. 
        print(result1)
        
        result1 = cursor2.fetchmany(10) # 10개 출력후 그이후 10개 출력.
        print(result1)

[(100, 'Steven', 'AD_PRES', 100, datetime.datetime(2003, 6, 17, 0, 0), 27000.0, 0.2, 90), (101, 'Neena', 'AD_VP', 100, datetime.datetime(2005, 9, 21, 0, 0), 17000.0, None, 90), (102, 'Lex', 'AD_VP', 100, datetime.datetime(2001, 1, 13, 0, 0), 17000.0, None, 90), (103, 'Alexander', 'IT_PROG', 102, datetime.datetime(2006, 1, 3, 0, 0), 9000.0, None, 60), (104, 'Bruce', 'IT_PROG', 103, datetime.datetime(2007, 5, 21, 0, 0), 6000.0, None, 60), (105, 'David', 'IT_PROG', 103, datetime.datetime(2005, 6, 25, 0, 0), 4800.0, None, 60), (106, 'Valli', 'IT_PROG', 103, datetime.datetime(2006, 2, 5, 0, 0), 4800.0, None, 60), (107, 'Diana', 'IT_PROG', 103, datetime.datetime(2007, 2, 7, 0, 0), 4200.0, None, 60), (108, 'Nancy', 'FI_MGR', 101, datetime.datetime(2002, 8, 17, 0, 0), 12008.0, None, 100), (109, 'Daniel', 'FI_ACCOUNT', 108, datetime.datetime(2002, 8, 16, 0, 0), 9000.0, None, 100)]
[(110, 'John', 'FI_ACCOUNT', 108, datetime.datetime(2005, 9, 28, 0, 0), 8200.0, None, 100), (111, 'Ismael', 'FI_ACCOUNT', 108, datetime.datetime(2005, 9, 30, 0, 0), 7700.0, None, 100), (112, 'Jose Manuel', 'FI_ACCOUNT', 108, datetime.datetime(2006, 3, 7, 0, 0), 7800.0, None, 100), (113, 'Luis', 'FI_ACCOUNT', 108, datetime.datetime(2007, 12, 7, 0, 0), 6900.0, None, 100), (114, 'Den', 'PU_MAN', 100, datetime.datetime(2002, 12, 7, 0, 0), 11000.0, None, 30), (115, 'Alexander', 'PU_MAN', 100, datetime.datetime(2003, 5, 18, 0, 0), 9100.0, None, 30), (116, 'Shelli', 'PU_CLERK', 114, datetime.datetime(2005, 12, 24, 0, 0), 2900.0, None, 30), (117, 'Sigal', 'PU_CLERK', 114, datetime.datetime(2005, 7, 24, 0, 0), 2800.0, None, 30), (118, 'Guy', 'PU_CLERK', 114, datetime.datetime(2006, 11, 15, 0, 0), 2600.0, None, 30), (119, 'Karen', 'PU_CLERK', 114, datetime.datetime(2007, 8, 10, 0, 0), 2500.0, None, 30)]

### cursor를 for in 문을 이용해 select결과 조회
- select후 cursor는 Iterable 한 객체.
- cursor는 반복시마다 조회한 한행을 반환.

In [33]:
import cx_Oracle

sql = "SELECT * FROM emp WHERE comm_pct  IS NOT NULL ORDER BY emp_id"

with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.execute(sql)
        #r = cursor.fetchone()
        # while r != None:
        #     print(r)
        #     print("--------------------------")
        #     r = cursor.fetchone()
        # 한행씩 조회한 뒤에 처리하는 경우.
        for idx, row in enumerate(cursor, start=1):
            print(f'{idx}. {row}')
        #print(cursor.fetchone())
        #print("--------------------------")

1. (100, 'Steven', 'AD_PRES', 100, datetime.datetime(2003, 6, 17, 0, 0), 27000.0, 0.2, 90)
2. (145, 'John', 'SA_MAN', 100, datetime.datetime(2004, 10, 1, 0, 0), 14000.0, 0.4, 80)
3. (146, 'Karen', 'SA_MAN', 100, datetime.datetime(2004, 10, 1, 0, 0), 13500.0, 0.3, 80)
4. (147, 'Alberto', 'SA_MAN', 100, datetime.datetime(2005, 3, 10, 0, 0), 12000.0, 0.3, 80)
5. (148, 'Gerald', 'SA_MAN', 100, datetime.datetime(2007, 10, 15, 0, 0), 11000.0, 0.3, 80)
6. (149, 'Eleni', 'SA_MAN', 100, datetime.datetime(2007, 10, 15, 0, 0), 10500.0, 0.2, 80)
7. (150, 'Peter', 'SA_REP', 145, datetime.datetime(2007, 10, 15, 0, 0), 10000.0, 0.3, 80)
8. (151, 'David', 'SA_REP', 145, datetime.datetime(2005, 3, 24, 0, 0), 9500.0, 0.25, 80)
9. (152, 'Peter', 'SA_REP', 145, datetime.datetime(2005, 8, 20, 0, 0), 9000.0, 0.25, 80)
10. (153, 'Christopher', 'SA_REP', 145, datetime.datetime(2006, 3, 30, 0, 0), 8000.0, 0.2, 80)
11. (154, 'Nanette', 'SA_REP', 145, datetime.datetime(2006, 12, 9, 0, 0), 7500.0, 0.2, 80)
12. (155, 'Oliver', 'SA_REP', 145, datetime.datetime(2007, 11, 23, 0, 0), 7000.0, 0.15, 80)
13. (156, 'Janette', 'SA_REP', 146, datetime.datetime(2004, 1, 30, 0, 0), 10000.0, 0.35, 80)
14. (157, 'Patrick', 'SA_REP', 146, datetime.datetime(2004, 3, 4, 0, 0), 9500.0, 0.35, 80)
15. (158, 'Allan', 'SA_REP', 146, datetime.datetime(2004, 8, 1, 0, 0), 9000.0, 0.35, 80)
16. (159, 'Lindsey', 'SA_REP', 146, datetime.datetime(2005, 3, 10, 0, 0), 8000.0, 0.3, 80)
17. (160, 'Louise', 'SA_REP', 146, datetime.datetime(2005, 12, 15, 0, 0), 7500.0, 0.3, 80)
18. (161, 'Sarath', 'SA_REP', 146, datetime.datetime(2006, 11, 3, 0, 0), 7000.0, 0.25, 80)
19. (162, 'Clara', 'SA_REP', 147, datetime.datetime(2005, 11, 11, 0, 0), 10500.0, 0.25, 80)
20. (163, 'Danielle', 'SA_REP', 147, datetime.datetime(2007, 3, 19, 0, 0), 9500.0, 0.15, 80)
21. (164, 'Mattea', 'SA_REP', 147, datetime.datetime(2008, 1, 24, 0, 0), 7200.0, 0.1, 80)
22. (165, 'David', 'SA_REP', 147, datetime.datetime(2008, 2, 23, 0, 0), 6800.0, 0.1, 80)
23. (166, 'Sundar', 'SA_REP', 147, datetime.datetime(2008, 3, 24, 0, 0), 6400.0, 0.1, 80)
24. (167, 'Amit', 'SA_REP', 147, datetime.datetime(2008, 4, 21, 0, 0), 6200.0, 0.1, 80)
25. (168, 'Lisa', 'SA_REP', 148, datetime.datetime(2005, 3, 11, 0, 0), 11500.0, 0.25, 80)
26. (169, 'Harrison', 'SA_REP', 148, datetime.datetime(2006, 3, 23, 0, 0), 10000.0, 0.2, 80)
27. (170, 'Tayler', 'SA_REP', 148, datetime.datetime(2006, 1, 24, 0, 0), 9600.0, 0.2, 80)
28. (171, 'William', 'SA_REP', 148, datetime.datetime(2007, 2, 23, 0, 0), 7400.0, 0.15, 80)
29. (172, 'Elizabeth', 'SA_REP', 148, datetime.datetime(2007, 3, 24, 0, 0), 7300.0, 0.15, 80)
30. (173, 'Sundita', 'SA_REP', 148, datetime.datetime(2008, 4, 21, 0, 0), 6100.0, 0.1, 80)
31. (174, 'Ellen', 'SA_REP', 149, datetime.datetime(2004, 5, 11, 0, 0), 11000.0, 0.3, 80)
32. (175, 'Alyssa', 'SA_REP', 149, datetime.datetime(2005, 3, 19, 0, 0), 8800.0, 0.25, None)
33. (176, 'Jonathon', 'SA_REP', 149, datetime.datetime(2006, 3, 24, 0, 0), 8600.0, 0.2, 80)
34. (177, 'Jack', 'SA_REP', 149, datetime.datetime(2006, 4, 23, 0, 0), 8400.0, 0.2, 80)
35. (178, 'Kimberely', 'SA_REP', 149, datetime.datetime(2007, 5, 24, 0, 0), 7000.0, 0.15, None)
36. (179, 'Charles', 'SA_REP', 149, datetime.datetime(2008, 1, 4, 0, 0), 6200.0, 0.1, 80)
37. (1500, 'HONG', 'FI_ACCOUNT', 101, datetime.datetime(2021, 2, 15, 0, 0), 30000.0, 0.2, 100)
38. (1501, 'HONG', 'FI_ACCOUNT', 101, datetime.datetime(2021, 2, 15, 0, 0), 30000.0, 0.2, 100)
39. (1502, 'HONG', 'FI_ACCOUNT', 101, datetime.datetime(2021, 2, 15, 0, 0), 30000.0, 0.2, 100)
40. (1503, 'HONG', 'FI_ACCOUNT', 101, datetime.datetime(2021, 2, 15, 0, 0), 30000.0, 0.2, 100)

In [35]:
sql = "SELECT job_id, sum(salary), round(avg(salary),2) FROM emp GROUP BY job_id"
with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.execute(sql)
        result = cursor.fetchall()
        pprint(result)

[('FI_ACCOUNT', 205478, 17123.17),
 ('AD_VP', 34000, 17000),
 ('PU_CLERK', 10800, 2700),
 ('SH_CLERK', 55900, 3288.24),
 ('HR_REP', 6500, 6500),
 ('PU_MAN', 20100, 10050),
 ('AC_MGR', 12008, 12008),
 ('ST_CLERK', 47900, 2817.65),
 ('AD_ASST', 5500, 5500),
 ('IT_PROG', 28800, 5760),
 (None, 16200, 2700),
 ('SA_MAN', 61000, 12200),
 ('AC_ACCOUNT', 8300, 8300),
 ('FI_MGR', 12008, 12008),
 ('ST_MAN', 36400, 7280),
 ('AD_PRES', 27000, 27000),
 ('MK_MAN', 13000, 13000),
 ('SA_REP', 250500, 8350),
 ('MK_REP', 6000, 6000),
 ('PR_REP', 10000, 10000)]

In [38]:
sql = "SELECT e.emp_name, d.dept_name FROM emp e left join dept d ON e.dept_id = d.dept_id"
with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.execute(sql)
        result = cursor.fetchall()
        pprint(result)

[('Jennifer', 'Administration'),
 ('강길동', 'Administration'),
 ('Michael', 'Marketing'),
 ('Pat', 'Marketing'),
 ('Den', 'Purchasing'),
 ('Alexander', 'Purchasing'),
 ('Shelli', 'Purchasing'),
 ('Sigal', 'Purchasing'),
 ('Guy', 'Purchasing'),
 ('Karen', 'Purchasing'),
 ('Susan', 'Human Resources'),
 ('Matthew', 'Shipping'),
 ('Adam', 'Shipping'),
 ('Payam', 'Shipping'),
 ('Shanta', 'Shipping'),
 ('Kevin', 'Shipping'),
 ('Julia', 'Shipping'),
 ('Irene', 'Shipping'),
 ('James', 'Shipping'),
 ('Steven', 'Shipping'),
 ('Laura', 'Shipping'),
 ('Mozhe', 'Shipping'),
 ('James', 'Shipping'),
 ('TJ', 'Shipping'),
 ('Jason', 'Shipping'),
 ('Michael', 'Shipping'),
 ('Ki', 'Shipping'),
 ('Hazel', 'Shipping'),
 ('Renske', 'Shipping'),
 ('Stephen', 'Shipping'),
 ('John', 'Shipping'),
 ('Joshua', 'Shipping'),
 ('Trenna', 'Shipping'),
 ('Curtis', 'Shipping'),
 ('Randall', 'Shipping'),
 ('Peter', 'Shipping'),
 ('Winston', 'Shipping'),
 ('Jean', 'Shipping'),
 ('Martha', 'Shipping'),
 ('Julia', 'Shipping'),
 ('Anthony', 'Shipping'),
 ('Kelly', 'Shipping'),
 ('Jennifer', 'Shipping'),
 ('Timothy', 'Shipping'),
 ('Randall', 'Shipping'),
 ('Sarah', 'Shipping'),
 ('Britney', 'Shipping'),
 ('Samuel', 'Shipping'),
 ('Vance', 'Shipping'),
 ('Alana', 'Shipping'),
 ('Kevin', 'Shipping'),
 ('Donald', 'Shipping'),
 ('Douglas', 'Shipping'),
 ('Alexander', 'IT'),
 ('Bruce', 'IT'),
 ('David', 'IT'),
 ('Valli', 'IT'),
 ('Diana', 'IT'),
 ('Hermann', 'Public Relations'),
 ('John', 'Sales'),
 ('Karen', 'Sales'),
 ('Alberto', 'Sales'),
 ('Gerald', 'Sales'),
 ('Eleni', 'Sales'),
 ('Peter', 'Sales'),
 ('David', 'Sales'),
 ('Peter', 'Sales'),
 ('Christopher', 'Sales'),
 ('Nanette', 'Sales'),
 ('Oliver', 'Sales'),
 ('Janette', 'Sales'),
 ('Patrick', 'Sales'),
 ('Allan', 'Sales'),
 ('Lindsey', 'Sales'),
 ('Louise', 'Sales'),
 ('Sarath', 'Sales'),
 ('Clara', 'Sales'),
 ('Danielle', 'Sales'),
 ('Mattea', 'Sales'),
 ('David', 'Sales'),
 ('Sundar', 'Sales'),
 ('Amit', 'Sales'),
 ('Lisa', 'Sales'),
 ('Harrison', 'Sales'),
 ('Tayler', 'Sales'),
 ('William', 'Sales'),
 ('Elizabeth', 'Sales'),
 ('Sundita', 'Sales'),
 ('Ellen', 'Sales'),
 ('Jonathon', 'Sales'),
 ('Jack', 'Sales'),
 ('Charles', 'Sales'),
 ('Steven', 'Executive'),
 ('Neena', 'Executive'),
 ('Lex', 'Executive'),
 ('HONG', 'Finance'),
 ('HONG', 'Finance'),
 ('Nancy', 'Finance'),
 ('Daniel', 'Finance'),
 ('John', 'Finance'),
 ('Ismael', 'Finance'),
 ('Jose Manuel', 'Finance'),
 ('Luis', 'Finance'),
 ('HONG', 'Finance'),
 ('HONG', 'Finance'),
 ('이순신', 'Accounting'),
 ('Shelley', 'Accounting'),
 ('William', 'Accounting'),
 ('이순신', 'Accounting'),
 ('Alyssa', None),
 ('Kimberely', None),
 ('Girard', None),
 ('Nandita', None),
 ('Alexis', None)]

## INSERT / UPDATE/ DELETE
- SQL 실행 후 Connection객체의 commit()을 호출 해야 최종적으로 적용된다.
- commit()
    - 최종 적용
- rollback()
    - 변경전 상태로 되돌리기

### 사용할 테이블
```sql
create table test(
    id varchar2(10),
    name varchar2(100),
    age number(3));
```

In [39]:
import cx_Oracle

create_sql = 'create table test(id varchar2(10), name varchar2(100), age number(3))'
insert_sql = 'INSERT INTO test VALUES (:1,:2,:3)'

with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        try:
            # Create
            cursor.execute(create_sql)
        except Exception as e:
            print(e)
        # Insert
        cursor.execute(insert_sql, [1, '이름1', 20])
        cursor.execute(insert_sql, [2, '이름2', 30])
        cursor.execute(insert_sql, [3, '이름3', 40])
        conn.commit()  # commit 처리

ORA-00955: 기존의 객체가 이름을 사용하고 있습니다.

In [50]:
select_sql = "select * from test"
with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.execute(select_sql)
        pprint(cursor.fetchall())

[('2', '새이름', 30),
 ('3', '새이름', 40),
 ('2', '새이름', 30),
 ('3', '새이름', 40),
 ('a-1', '이름1', 20),
 ('a-2', '이름2', 30),
 ('a-3', '이름3', 40),
 ('a-4', '이름4', 50),
 ('a-1', '이름1', 20),
 ('a-2', '이름2', 30),
 ('a-3', '이름3', 40),
 ('a-4', '이름4', 50)]

In [41]:
delete_sql = "DELETE FROM test WHERE name =:1"
with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.execute(delete_sql, ['이름1'])
        conn.commit()

In [44]:
update_sql = "UPDATE test SET name = :1"
with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.execute(update_sql, ['새이름'])
        conn.commit()

## batch(일괄작업) 처리
- 한번에 메소드 호출로 다수 행을 처리한다.
- executemany(sql, placeholder에 전달할값)
    - placeholder에 전달할 값을 list로 묶어서 전달하면 sql문이 그 개수만큼 한번에 처리된다.

In [49]:
insert_sql = "INSERT INTO test VALUES (:1,:2,:3)"
param = [
    ['a-1','이름1',20],
    ['a-2','이름2',30],
    ['a-3','이름3',40],
    ['a-4','이름4',50]
]

with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.executemany(insert_sql, param)
        conn.commit()

## TODO : 매개변수로 dept_id를 받아서 EMP 테이블에서 그 부서의 직원들의 salary를 두배 update하는 함수.

In [76]:
select_sql = 'select emp_name, salary from emp where dept_id = 10'
with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.execute(select_sql)
        pprint(cursor.fetchall())

[('Jennifer', 5500.0), ('강길동', 7000.0)]

In [77]:

def update_salary_by_dept_id(dept_id): 
    update_sql = 'UPDATE emp SET salary = salary * 2 WHERE dept_id in :1'
    select_sql = 'select emp_name, salary from emp where dept_id = :1'
    with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
        with conn.cursor() as cursor:
            cursor.execute(update_sql, [dept_id])
            cursor.execute(select_sql, [dept_id])
            pprint(cursor.fetchall())

In [79]:
update_salary_by_dept_id(10)

[('Jennifer', 11000.0), ('강길동', 14000.0)]

## TODO : 매개변수로 job_id를 받아서 그 업무를 하는 직원들을 EMP 테이블에서 삭제하는 함수.

In [86]:
select_sql = "select count(*) from emp where job_id in 'AD_VP'"
with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        cursor.execute(select_sql)
        pprint(cursor.fetchall())

[(2,)]

In [88]:
def delete_emp_by_job_id(job_id):
    delete_sql = 'DELETE FROM emp WHERE job_id = :1'
    select_sql = "select count(*) from emp"
    with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
        with conn.cursor() as cursor:
            cursor.execute(delete_sql,[job_id])
            cursor.execute(select_sql)
            print(cursor.fetchall())

In [89]:
delete_emp_by_job_id('AD_VP')

[(112,)]

# TODO : 매개변수로 직원 이름을 입력받아 EMP 테이블에서 그  직원들의 전체 정보를 조회결과를 출력하는 함수.

In [90]:
def select_by_emp_name(emp_name):
    select_sql = "SELECT * FROM emp WHERE emp_name in :1"
    with cx_Oracle.connect("c##scott_join/tiger@localhost:1521/XE") as conn:
        with conn.cursor() as cursor:
            cursor.execute(select_sql,[emp_name])
            print(cursor.fetchall())

In [91]:
select_by_emp_name('이순신')

[(2001, '이순신', 'FI_ACCOUNT', 101, datetime.datetime(2021, 2, 13, 0, 0), 18888.0, None, 110), (2000, '이순신', 'FI_ACCOUNT', 101, datetime.datetime(2021, 2, 13, 0, 0), 19990.0, None, 110)]

# TODO: 사용자로 부터 직원정보를 입력받아 EMP 테이블에 입력한다.
- emp_id, emp_name, job_id, mgr_id, hire_date, salary, comm_pct, dept_id 를 하나씩 입력받는다.
- job_id, mgr_id, comm_pct, dept_id 을 입력하지 않은 경우 NULL 을 넣는다. (placehold 사용시 None을 대입)
- 입력된 값을 EMP 테이블에 insert 한다.
- 주의 job_id, mgr_id, dept_id는 FK 컬럼이므로 부모테이블의 PK값을 넣어야 한다.